fizykxyz/01Projekty-Techniczne/000_Bajzel/_PROJEKTY_/98_M32_GFX/SED1520/src/test/test_LPC21.c
/****************************************************************************
* Biblioteka obslugi wyswietlacza graficznego, opartego na sterowniku
* SED1520 lub odpowiedniku.
* 
* Program testowy dla platformy ARM7 LPC21XX.
*
* Nazwa pliku: test_LPC21.c
* Data: 20.08.2007
* Wersja: 1.0
*
* Copyright (C) 2007 by Rafal Baranowski.
*
* Niniejsze oprogramowanie udostepniane jest nieodplatnie i moze byc
* powielane, modyfikowane i wykorzystywane w celach komercyjnych pod
* warunkiem zachowania noty copyright.
* Na poprawne dzialanie i bezpieczenstwo tego oprogramowania nie jest
* udzalana zadna gwarancja.
****************************************************************************/

#include <SED1520.h>
#include <disp_conf.h>
#include <platf_conf.h>
#include <LPC21XX.h>

#define NO_OF_TEST 20

#define KEY_01_PIN IOPIN1
#define KEY_2_PIN IOPIN1
#define KEY_0 24
#define KEY_1 25
#define KEY_2 26

#define get_key0() (!(KEY_01_PIN & (1<<KEY_0)))
#define get_key1() (!(KEY_01_PIN & (1<<KEY_1)))
#define get_key2() (!(KEY_2_PIN & (1<<KEY_2)))

const char intro[] = "Test SED1520";
const char end[] = " Test end";
const char test[] = "Test";
const uint8_t charset[] = CHARSET;

uint8_t pict1[] = { /* width 50, length 7 */
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x01,
  0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01,
  0x02, 0xA0, 0xAA, 0xAA, 0xAA, 0x00, 0x01,
  0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01,
  0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x01,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  
uint8_t pictc[168];
  
const uint8_t cpict2[] = { /* width 16, length 20*/
  0x00, 0x00,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0xAE, 0x7A,
  0x5E, 0x75,
  0x00, 0x00};

volatile uint8_t test_no = 0;

void itoa(uint8_t number, char* string, uint8_t radix) {
  if (number >= radix*radix) {
    *(string++) = (number / (radix*radix)) + 0x30;
    number %= radix*radix;
    *(string++) = (number / radix) + 0x30;
    number %= radix;
  } else if (number >= radix) {
    *(string++) = (number / radix) + 0x30;
    number %= radix;
  }
  *(string++) = (number) + 0x30;
  *(string) = 0;
}

void wait_ms(int ms) {
  while(ms--)
    delay_ms(1);
}

void wait_key0(void) {
  while(!get_key0());
  wait_ms(10);
  while(get_key0());
  wait_ms(10);
}
    
void wait_key1(void) {
  while(!get_key1());
  wait_ms(10);
  while(get_key1());
  wait_ms(10);
}

void wait_key2(void) {
  while(!get_key2());
  wait_ms(10);
  while(get_key2());
  wait_ms(10);
}

uint8_t chk_keyb(void) {
  if (get_key0()) {
    
    if (test_no-- == 0)
      test_no = NO_OF_TEST;
    
    wait_key0();
    return 1;
  }
  
  if (get_key1()) {
    
    if (test_no++ == NO_OF_TEST)
      test_no = 0;
      
    wait_key1();
    return 1;
  }
  
  if (get_key2()) {
    wait_key2();
    return 2;
  }
  
  return 0;
}

uint8_t def_ini(char* string) {
  char num[3];
  uint8_t result;
  
  Disp_set_update(IMMEDIATELY);
  Disp_clr();
  itoa(test_no, num, 10);
  Disp_putc('T');
  Disp_puts(num);
  Disp_putc(' ');
  Disp_puts(string);
  while(1) {
    result = chk_keyb();
    if (result)
      return result;
  }
}

void def_end(void) {
  char num[3];
  
  Disp_set_update(IMMEDIATELY);
  Disp_clr();
  itoa(test_no, num, 10);
  Disp_putc('T');
  Disp_puts(num);
  Disp_puts_const(end);
  while(!chk_keyb());
}

int main(void) {
  
  char char_str[1];
  uint8_t temp;
  
  Disp_init();
  Disp_set_ctempl_const(charset);
  Disp_set_update(IMMEDIATELY);
  
  Disp_box(0,0,121,31,ON,NO);
  Disp_set_cxy(4, 1);
  Disp_puts_const(intro);
  
  while(!chk_keyb());
  
  test_no = 0;
  
  while(1) {
    switch(test_no) {
      /*********************************************/
      case 0:
        if (def_ini("Init") == 1)
          break;
        
        Disp_init();
        Disp_puts("I1");
        wait_ms(300);
        
        Disp_init();
        Disp_puts("I2");
        wait_ms(300);
          
        Disp_init();
        Disp_puts("I3");
        wait_ms(300);
                  
        Disp_init();
        Disp_puts("I4");
        wait_ms(300);
                  
        Disp_init();
        Disp_puts("I5");
        
        def_end();
        break;
      /*********************************************/
      case 1:
        if (def_ini("Disp on-off") == 1)
          break;
        
        Disp_set(OFF);
        wait_key2();
        Disp_set(ON);
        wait_key2();
        
        def_end();
        break;
      /*********************************************/
      case 2:
        if (def_ini("Curs") == 1)
          break;
        
        Disp_set_cxy(0,1);
        Disp_puts("off");
        Disp_set_cur(OFF);
        wait_key2();
        
        Disp_set_cxy(0,1);
        Disp_puts("on ");
        Disp_set_cur(ON);
        wait_key2();
        
        for (uint8_t i=0; i<50; i++) {
          Disp_move_txt_cur(RIGHT);
          wait_ms(200);
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }
        for (uint8_t i=0; i<50; i++) {
          Disp_move_txt_cur(LEFT);
          wait_ms(200);
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }
          
        for (uint8_t i=0; i<10; i++) {
         for (uint8_t j=0; j<4; j++) {
            Disp_set_cxy(i,j);
            wait_ms(200);
            if (get_key2()) {
              while(get_key2());
              wait_ms(10);
              break;
            }
          }
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }
        
        Disp_set_cxy(0,0);
        for (uint8_t i=0; i<50; i++) {
          Disp_putc('X');
        }
        wait_key2();      
       
        def_end();
        break;
      /*********************************************/
      case 3:
        if (def_ini("INC/DEC") == 1)
          break;
        
        Disp_set_cur(ON);
        
        Disp_set_input_mode(INC);
        Disp_set_cxy(0,1);
        Disp_puts_const(test);
        wait_key2();
        
        Disp_set_input_mode(DEC);
        Disp_set_cxy(3,1);
        Disp_puts_const(test);
        wait_key2();
        
        def_end();
        break;
      /*********************************************/
      case 4:
        if (def_ini("Buf") == 1)
          break;
        
        Disp_set_cur(OFF);
        Disp_update();
        
        Disp_set_update(DEFERRED);
        Disp_set_cxy(0,1);
        Disp_puts("clk!");
        wait_key2();
        
        Disp_update();
        wait_key2();
        
        Disp_clr();
        Disp_update();
        Disp_puts_const(test);        
        wait_key2();
        
        if (Disp_get_ovf()) {
          Disp_flush_buffer();
          Disp_clr();
          Disp_puts("OVF!");
        }
          
        Disp_update();
        wait_key2();
        
        Disp_clr();
        Disp_puts("Flush");
        Disp_update();
        wait_key2();
        
        Disp_clr();
        Disp_puts("OK");
        Disp_update();
        Disp_set_cxy(0,0);
        Disp_puts("error");
        Disp_flush_buffer();
        Disp_update();
        wait_key2();
        
        Disp_set_update(IMMEDIATELY);
        Disp_clr();
        Disp_puts("Immed.");
        wait_key2();
        
        def_end();
        break;
      /*********************************************/
      case 5:
        if (def_ini("Lines") == 1)
          break;
        
        Disp_clr();
        for (uint8_t i=0; i<4; i++) {
          itoa(i, char_str, 10);
          Disp_set_cxy(i,i);
          Disp_puts("Line ");
          Disp_puts(char_str);
        }      
        
