fizykxyz/01Projekty-Techniczne/000_Bajzel/_PROJEKTY_/98_M32_GFX/SED1520/src/test/test_LPC21.c
        wait_key2();
        
        def_end();
        break;
      /*********************************************/
      case 6:
        if (def_ini("Cur pos") == 1)
          break;
        
        Disp_set_input_mode(INC);
        Disp_set_cur(ON);
        Disp_clr();
        
        Disp_puts("2=");
        itoa(Disp_get_cx(), char_str, 10);
        Disp_puts(char_str);
        wait_key2();
        Disp_set_cxy(2,0);
        itoa(Disp_get_cx(), char_str, 10);
        Disp_puts(char_str);
        Disp_puts("  ");
        
        Disp_set_cxy(0,1);
        Disp_puts("1=");
        itoa(Disp_get_cy(), char_str, 10);
        Disp_puts(char_str);
        wait_key2();
        Disp_set_cxy(2,1);
        itoa(Disp_get_cy(), char_str, 10);
        Disp_puts(char_str);
        
        Disp_set_input_mode(DEC);
        Disp_set_cxy(10,0);
        Disp_puts("8=");
        itoa(Disp_get_cx(), char_str, 10);
        Disp_puts(char_str);
        wait_key2();
        Disp_set_cxy(8,0);
        itoa(Disp_get_cx(), char_str, 10);
        Disp_puts(char_str);
        wait_key2();

        def_end();
        break;
      /*********************************************/
      case 7:
        if (def_ini("Move C/W") == 1)
          break;
          
        Disp_set_cur(ON);
        
        Disp_clr();
        Disp_puts("RT");
        Disp_move_txt_cur(RIGHT);
        Disp_putc('!');
        
        Disp_set_cxy(0,1);
        Disp_puts("LT ");
        Disp_move_txt_cur(LEFT);
        Disp_putc('!');
        
        wait_key2();
        
        for (int i=0; i<15; i++) {
          Disp_scroll_window(DOWN);
          wait_ms(150);
        }
        
        for (int i=0; i<15; i++) {
          Disp_scroll_window(UP);
          wait_ms(150);
        }

        def_end();
        break;
      /*********************************************/
      case 8:
        if (def_ini("Clear") == 1)
          break;
          
        for (int i=0; i<4; i++) {
          Disp_set_cxy(0,i);
          for (int j=0; j<20; j++)
            Disp_putc('X');
        }
        
        wait_key2();
        Disp_clr();
        Disp_puts("Clr.");
        wait_key2();

        def_end();
        break;
      /*********************************************/
      case 9:
        if (def_ini("Cur ret") == 1)
          break;
        
        Disp_clr();
        Disp_set_cur(ON);
        
        Disp_ret_cur();
        wait_key2();
        
        Disp_set_cxy(3,2);
        Disp_ret_cur();
        wait_key2();
        
        Disp_set_cxy(13,3);
        Disp_ret_cur();
        wait_key2();

        def_end();
        break;
      /*********************************************/
      case 10:
        if (def_ini("Pic R/W") == 1)
          break;
          
        for (uint8_t i=0; i<8; i++) {
          for (uint8_t j=0; j<8; j++) {
            Disp_clr();
            Disp_set_pxy(40+i,j);
            Disp_put_picture(pict1, 50, 7);
            Disp_set_pxy(40+i,j);
            Disp_get_picture(pictc, 50, 7);
            Disp_set_pxy(40+i,j+8);
            Disp_put_picture(pictc, 50, 7);
            wait_ms(200);    
            if (get_key2())
             break;      
          }
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }
        
        for (uint8_t i=0; i<8; i++) {
          for (uint8_t j=0; j<8; j++) {
            Disp_box(0,0,121,31,ON,YES);
            Disp_set_pxy(40+i,j);
            Disp_put_picture(pict1, 50, 7);
            Disp_set_pxy(40+i,j);
            Disp_get_picture(pictc, 50, 7);
            Disp_set_pxy(40+i,j+8);
            Disp_put_picture(pictc, 50, 7);
            wait_ms(200);
            if (get_key2())
             break;      
          }
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }
        
        for (uint8_t i=0; i<10; i++) {
          Disp_clr();
          Disp_set_pxy(40,i);
          Disp_put_picture_const(cpict2, 16, 20);
          Disp_set_pxy(40,i);
          Disp_get_picture(pictc, 16, 20);
          Disp_set_pxy(80,i);
          Disp_put_picture(pictc, 16, 20);
          wait_ms(200);
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }

        for (uint8_t i=0; i<10; i++) {
          Disp_box(0,0,121,31,ON,YES);
          Disp_set_pxy(40,i);
          Disp_put_picture_const(cpict2, 16, 20);
          Disp_set_pxy(40,i);
          Disp_get_picture(pictc, 16, 20);
          Disp_set_pxy(80,i);
          Disp_put_picture(pictc, 16, 20);
          wait_ms(200);
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }

        def_end();
        break;
      /*********************************************/
      case 11:
        if (def_ini("CG ROM") == 1)
          break;
        
        Disp_set_cxy(0,1);
        Disp_putc(PL_A);
        Disp_putc(PL_C);
        Disp_putc(PL_E);
        Disp_putc(PL_L);
        Disp_putc(PL_N);
        Disp_putc(PL_O);
        Disp_putc(PL_S);
        Disp_putc(PL_Z);
        Disp_set_cxy(0,2);
        Disp_putc(PL_a);
        Disp_putc(PL_c);
        Disp_putc(PL_e);
        Disp_putc(PL_l);
        Disp_putc(PL_n);
        Disp_putc(PL_o);
        Disp_putc(PL_s);
        Disp_putc(PL_z);
        
        wait_key2();

        def_end();
        break;
      /*********************************************/
      case 12:
        if (def_ini("Pic WR ROM") == 1)
          break;
        
        for (uint8_t i=0; i<10; i++) {
          Disp_box(0,0,121,31,ON,YES);
          Disp_set_pxy(55,i);
          Disp_put_picture_const(cpict2, 16, 20);
          wait_ms(200);
          if (get_key2()) {
            while(get_key2());
            wait_ms(10);
            break;
          }
        }
        
        def_end();
        break;
      /*********************************************/
      case 13:
        if (def_ini("Pic play") == 1)
          break;
        
        Disp_set_update(DEFERRED);
        Disp_set_pxy(10,10);
        Disp_lineto(20,20, ON);
        Disp_lineto(30,10, ON);
        Disp_lineto(40,20, ON);
        Disp_lineto(50,10, ON);
        Disp_lineto(60,20, ON);
        Disp_lineto(70,10, ON);
        Disp_lineto(70,20, ON);
        Disp_lineto(60,10, ON);
        Disp_lineto(50,20, ON);
        Disp_lineto(40,10, ON);
        Disp_lineto(30,20, ON);
        Disp_lineto(20,10, ON);
        Disp_lineto(10,20, ON);
        Disp_lineto(10,10, ON);
        Disp_lineto(70,10, ON);
        Disp_lineto(70,20, ON);
        Disp_lineto(10,20, ON);
        Disp_set_update(IMMEDIATELY);
        wait_key2();
        
        Disp_set_pxy(10,10);
        Disp_get_picture(pictc,61,11);
        
        Disp_set_update(DEFERRED);
        Disp_clr();
        Disp_set_pxy(0,0);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(61,0);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(0,11);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(61,11);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(30,5);
        Disp_put_picture(pictc,61,11);
        Disp_update();
        wait_key2();
        
