fizykxyz/01Projekty-Techniczne/000_Bajzel/_PROJEKTY_/98_M32_GFX/SED1520/src/test/test_LPC21.c
        Disp_box(0,0,121,31,ON,YES);
        Disp_set_pxy(0,0);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(61,0);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(0,11);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(61,11);
        Disp_put_picture(pictc,61,11);
        Disp_set_pxy(30,5);
        Disp_put_picture(pictc,61,11);
        Disp_set_update(IMMEDIATELY);
        wait_key2();

        def_end();
        break;
      /*********************************************/
      case 14:
        if (def_ini("Err chk") == 1)
          break;
        
        Disp_init();
        Disp_clr();
        Disp_puts("...");
        temp = Disp_get_error();
        
        wait_key2();
        
        Disp_init();
        Disp_clr();
        if (temp)
          Disp_puts("Err");
        else
          Disp_puts("No Err");
        
        wait_key2();

        def_end();
        break;
      /*********************************************/
      case 15:
        if (def_ini("H. lines") == 1)
          break;
          
        Disp_clr();
        Disp_set_pxy(1, 1);
        Disp_hlineto(1, ON);
        Disp_set_pxy(1, 2);
        Disp_hlineto(2, ON);
        Disp_set_pxy(1, 3);
        Disp_hlineto(3, ON);
        Disp_set_pxy(1, 4);
        Disp_hlineto(2, ON);
        Disp_hlineto(4, ON);
        wait_key2();
        
        Disp_clr();
        Disp_set_pxy(1, 1);
        Disp_hlineto(1, ON);
        Disp_set_pxy(2, 2);
        Disp_hlineto(1, ON);
        Disp_set_pxy(3, 3);
        Disp_hlineto(1, ON);
        Disp_set_pxy(4, 4);
        Disp_hlineto(3, ON);
        Disp_hlineto(1, ON);
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        Disp_set_pxy(1, 1);
        Disp_hlineto(1, OFF);
        Disp_set_pxy(1, 2);
        Disp_hlineto(2, OFF);
        Disp_set_pxy(1, 3);
        Disp_hlineto(3, OFF);
        Disp_set_pxy(1, 4);
        Disp_hlineto(2, OFF);
        Disp_hlineto(4, OFF);
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        Disp_set_pxy(1, 1);
        Disp_hlineto(1, OFF);
        Disp_set_pxy(2, 2);
        Disp_hlineto(1, OFF);
        Disp_set_pxy(3, 3);
        Disp_hlineto(1, OFF);
        Disp_set_pxy(4, 4);
        Disp_hlineto(3, OFF);
        Disp_hlineto(1, OFF);
        wait_key2();
        
        Disp_set_update(DEFERRED);
        Disp_clr();
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(32, i);
          Disp_hlineto(32+i, ON);
        }
        Disp_update();
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(32, i);
          Disp_hlineto(32+i, OFF);
        }
        Disp_update();
        wait_key2();
        
        Disp_clr();
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(96, i);
          Disp_hlineto(96-i, ON);
        }
        Disp_update();
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(96, i);
          Disp_hlineto(96-i, OFF);
        }
        Disp_update();
        wait_key2();
        
        Disp_clr();
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(i+45, i);
          Disp_hlineto(76-i, ON);
        }
        Disp_update();
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(i+45, i);
          Disp_hlineto(76-i, OFF);
        }
        Disp_set_update(IMMEDIATELY);
        wait_key2();

        def_end();
        break;     
      /*********************************************/
      case 16:
        if (def_ini("V. lines") == 1)
          break;
          
        Disp_clr();
        Disp_set_pxy(1, 1);
        Disp_vlineto(1, ON);
        Disp_set_pxy(2, 1);
        Disp_vlineto(2, ON);
        Disp_set_pxy(3, 1);
        Disp_vlineto(3, ON);
        Disp_set_pxy(4, 1);
        Disp_vlineto(2, ON);
        Disp_vlineto(4, ON);
        wait_key2();
        
        Disp_clr();
        Disp_set_pxy(1, 1);
        Disp_vlineto(1, ON);
        Disp_set_pxy(2, 2);
        Disp_vlineto(1, ON);
        Disp_set_pxy(3, 3);
        Disp_vlineto(1, ON);
        Disp_set_pxy(4, 4);
        Disp_vlineto(3, ON);
        Disp_vlineto(1, ON);
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        Disp_set_pxy(1, 1);
        Disp_vlineto(1, OFF);
        Disp_set_pxy(2, 1);
        Disp_vlineto(2, OFF);
        Disp_set_pxy(3, 1);
        Disp_vlineto(3, OFF);
        Disp_set_pxy(4, 1);
        Disp_vlineto(2, OFF);
        Disp_vlineto(4, OFF);
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        Disp_set_pxy(1, 1);
        Disp_vlineto(1, OFF);
        Disp_set_pxy(2, 2);
        Disp_vlineto(1, OFF);
        Disp_set_pxy(3, 3);
        Disp_vlineto(1, OFF);
        Disp_set_pxy(4, 4);
        Disp_vlineto(3, OFF);
        Disp_vlineto(1, OFF);
        wait_key2();
        
        Disp_clr();
        Disp_set_update(DEFERRED);
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(32+i, 0);
          Disp_vlineto(i, ON);
        }
        Disp_update();
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(32+i, 0);
          Disp_vlineto(i, OFF);
        }
        Disp_update();
        wait_key2();
        
        Disp_clr();
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(32+i, 31);
          Disp_vlineto(i, ON);
        }
        Disp_update();
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(32+i, 31);
          Disp_vlineto(i, OFF);
        }
        Disp_update();
        wait_key2();
        
        Disp_clr();
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(45+i, i);
          Disp_vlineto(31-i, ON);
        }
        Disp_update();
        wait_key2();
        
