fizykxyz/01Projekty-Techniczne/000_Bajzel/_PROJEKTY_/98_M32_GFX/SED1520/src/test/test_LPC21.c
        Disp_box(0,0,121,31,ON,YES);
        for (uint8_t i=0; i<32; i++) {
          Disp_set_pxy(45+i, i);
          Disp_vlineto(31-i, OFF);
        }
        Disp_set_update(IMMEDIATELY);
        wait_key2();

        def_end();
        break;   
      /*********************************************/
      case 17:
        if (def_ini("Rand lines") == 1)
          break;
        
        Disp_clr();
        Disp_set_pxy(0,0);
        Disp_lineto(5,31,ON);
        Disp_lineto(10,0,ON);
        Disp_lineto(20,31,ON);
        Disp_lineto(30,0,ON);
        Disp_lineto(50,31,ON);
        Disp_lineto(70,0,ON);
        Disp_lineto(110,31,ON);
        Disp_lineto(121,0,ON);
        wait_key2();
        
        Disp_clr();
        Disp_set_pxy(0,0);
        Disp_lineto(121,5,ON);
        Disp_lineto(0,10,ON);
        Disp_lineto(121,20,ON);
        Disp_lineto(0,30,ON);
        Disp_lineto(121,31,ON);
        wait_key2();
        
        Disp_clr();
        Disp_set_pxy(0,0);
        Disp_lineto(121,31,ON);
        Disp_set_pxy(121,0);
        Disp_lineto(0,31,ON);
        wait_key2();
        
        Disp_clr();
        Disp_set_pxy(63,15);
        Disp_lineto(63,31,ON);
        Disp_set_pxy(63,15);
        Disp_lineto(63,0,ON);
        Disp_set_pxy(63,15);
        Disp_lineto(121,15,ON);
        Disp_set_pxy(63,15);
        Disp_lineto(0,15,ON);
        Disp_set_pxy(63,15);
        Disp_lineto(0,0,ON);
        Disp_set_pxy(63,15);
        Disp_lineto(0,31,ON);
        Disp_set_pxy(63,15);
        Disp_lineto(121,0,ON);
        Disp_set_pxy(63,15);
        Disp_lineto(121,31,ON);
        wait_key2();

        def_end();
        break;   
      /*********************************************/
      case 18:
        if (def_ini("Pix p/g") == 1)
          break;
        
        uint8_t temp;
        
        Disp_clr();
        Disp_set_pxy(10,10);
        Disp_putp(ON);
        Disp_set_pxy(20,10);
        Disp_putp(ON);
        Disp_set_pxy(10,20);
        Disp_putp(ON);
        Disp_set_pxy(20,20);
        Disp_putp(ON);
        for (uint8_t i=0; i<=10; i++)
          for (uint8_t j=0; j<=10; j++) {
            Disp_set_pxy(10+i, 10+j);
            temp = Disp_getp();
            Disp_set_pxy(64+10+i, 10+j);
            Disp_putp(temp);
          }
        wait_key2();
        
        Disp_box(0,0,121,31,ON,YES);
        Disp_set_pxy(10,10);
        Disp_putp(OFF);
        Disp_set_pxy(20,10);
        Disp_putp(OFF);
        Disp_set_pxy(10,20);
        Disp_putp(OFF);
        Disp_set_pxy(20,20);
        Disp_putp(OFF);
        for (uint8_t i=0; i<=10; i++)
          for (uint8_t j=0; j<=10; j++) {
            Disp_set_pxy(10+i, 10+j);
            temp = Disp_getp();
            Disp_set_pxy(64+10+i, 10+j);
            Disp_putp(temp);
          }
        wait_key2();

        def_end();
        break;   
      /*********************************************/
      case 19:
        if (def_ini("Box") == 1)
          break;
         
        Disp_clr();
        Disp_box(1,1,1,1,ON,NO);
        Disp_box(10,1,11,2,ON,NO);
        Disp_box(1,1+5,1,1+5,ON,NO);
        Disp_box(11,2+5,10,1+5,ON,NO);
        Disp_box(1+20,1,1+20,1,ON,YES);
        Disp_box(10+20,1,11+20,2,ON,YES);
        Disp_box(1+20,1+5,1+20,1+5,ON,YES);
        Disp_box(11+20,2+5,10+20,1+5,ON,YES);
        wait_key2();
               
        Disp_clr();
        Disp_box(1,1,120,30,ON,NO);
        Disp_box(118,28,3,3,ON,NO);
        Disp_box(5,5,116,26,ON,NO);
        Disp_box(114,24,7,7,ON,NO);
        Disp_box(9,9,112,22,ON,NO);
        Disp_box(110,20,11,11,ON,NO);
        wait_key2();
        
        Disp_clr();
        Disp_box(1,1,120,30,ON,YES);
        Disp_box(118,28,3,3,OFF,YES);
        Disp_box(5,5,116,26,ON,YES);
        Disp_box(114,24,7,7,OFF,YES);
        Disp_box(9,9,112,22,ON,YES);
        Disp_box(110,20,11,11,OFF,YES);
        wait_key2();

        def_end();
        break;   
      /*********************************************/
      case 20:
        if (def_ini("Txt WR") == 1)
          break;
        
        Disp_clr();
        Disp_set_cxy(DISP_C_COLS_NUM-2,DISP_C_ROWS_NUM-1);
        Disp_puts("RBLT");
        Disp_set_cxy(DISP_C_COLS_NUM-2,0);
        Disp_puts("RT");
        Disp_set_cxy(0,DISP_C_ROWS_NUM-1);
        Disp_puts("LB");
        Disp_set_cxy(DISP_C_COLS_NUM-1,DISP_C_ROWS_NUM/2-1);
        Disp_puts("12");
        wait_key2();
        
        Disp_clr();
        Disp_set_input_mode(DEC);
        Disp_set_cxy(1,0);
        Disp_puts("TLBR");
        Disp_set_cxy(DISP_C_COLS_NUM-1,0);
        Disp_puts("TR");
        Disp_set_cxy(1,DISP_C_ROWS_NUM-1);
        Disp_puts("BL");
        Disp_set_cxy(0,DISP_C_ROWS_NUM/2);
        Disp_puts("21");
        wait_key2();

        def_end();
        break;                
    }
  }

  return 0;
}
